IGCSE-physics-0625-0972.tex
% Created 2024-07-09 Tue 18:11
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Abhijit Bhopatkar}
\date{\today}
\title{Igcse Physics 0625 0972}
\hypersetup{
 pdfauthor={Abhijit Bhopatkar},
 pdftitle={Igcse Physics 0625 0972},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.6.24)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\begin{center}
\begin{tabular}{lrlll}
\hline
Month & Week & Dates & Sessions & Plan\\[0pt]
\hline
June & 1 & \textit{<2024-06-24 Mon>} & Introduction & Units and measurements\\[0pt]
 &  & \textit{<2024-06-25 Tue>} &  & Lengths\\[0pt]
 &  &  &  & Weights\\[0pt]
 &  &  &  & Volume\\[0pt]
 &  &  &  & Density\\[0pt]
 &  &  &  & Length\\[0pt]
 &  &  & Measurements & Repeatability\\[0pt]
 &  &  &  & Accuracy\\[0pt]
 &  &  &  & Errors\\[0pt]
\hline
July & 2 & \textit{<2024-07-01 Mon>} & Measurements & Measuring time\\[0pt]
 &  & \textit{<2024-07-02 Tue>} &  & Estimation\\[0pt]
 &  &  &  & Practical examples\\[0pt]
\hline
 & 3 & \textit{<2024-07-08 Mon>} & Practical & Observing pendulums\\[0pt]
 &  &  &  & Swinging on rope\\[0pt]
 &  &  &  & \\[0pt]
 &  & \textit{<2024-07-09 Tue>} &  & Measuring densities\\[0pt]
 &  &  &  & Measure Density of a human\\[0pt]
 &  &  &  & \\[0pt]
\hline
 &  & TBD & Recall & Practice problems and quiz\\[0pt]
\hline
\end{tabular}
\end{center}


\section{Physics}
\label{sec:orgb62e3d9}
\subsection{Units, Measurements and Accuracy}
\label{sec:orge27853c}
The aim of this unit is to describe different methods and aspects of physical measurements.
Introduction to inaccuracy and errors. Types units and recall of all the things they learned about lengths, weights, volumes
Introduction to density.

Practical measurements.


\begin{enumerate}
\item What are units?
\item How is length measured?
\item Accuracy or error in measurements.
\item Measuring earth's circumference.
\item Volumes.
\item Mass.
\item Density.
\item Measuring density of a human being.
\end{enumerate}

\subsubsection{Experiments}
\label{sec:orgfa761dc}
\begin{enumerate}
\item Measure a height of a building.
Measure length of the shadow of the building.
Measure length of a shadow of a meter stick.
\end{enumerate}
\begin{verbatim}

      +--=
      |  |=
     a|  | =       |-
      |  |  =     b| -
      +--=====     |===
           c         d

\end{verbatim}
\[
   \frac{a}{b} = \frac{c}{d} \therefore a = \frac{b * c}{d}
   \]

\begin{enumerate}
\item Measure circumference|of the earth.
Find which city has zero shadow day today and measure a shadow of long stick.
Use Eratosthenes's method to calculate circumference of Earth.

\item Measuring density of a human.
Dunk a child in a drum of water?
\end{enumerate}




\subsection{Lecture 1 - 2 (June 24th, 25th):}
\label{sec:orgb90026a}
\subsubsection{Equipment:}
\label{sec:org095f7a4}
Needles, Tennis balls, Measuring stick
Vernier caliper, protractor
Weighing machines,

\subsubsection{Brief: Introduction to physics}
\label{sec:orgccdac93}

Introduced scientific method and its application to physics. We touched briefly
about scope of physics and its day to day relevance. We touched upon
fundamentals of mathematics required for physics (the language of
physics/science).
Children learned about measuring different quantities like length, weight,
volume. Fundamental units (length, time, weight) as well as derived units
(density). were introduced.

\subsubsection{Transscript:}
\label{sec:org520292d}

What is physics?
Physics is a branch of science,
Its roots are in curiocity of the man to  find out answer
to the question. The question of The life, the universe and everything in it.

Scientific method.

\begin{enumerate}
\item Make a hypotheses, based on observed data.
\item Find the limitations.
\item Create an experiment to verify the hypotheses.
\item If the experiment succeeds, confidence on the theory increases.
\item If the experiment fails???? hypotheses MUST BE WRONG or at least missing
something.
\end{enumerate}


In physics we deal with
Daily objects (Juggle tennis balls)

To absolute large, the end of the universe

And to the beginning and end of the TIME.

To absolute small,
(show the needle and ask to look at the pointed tip)

\[ \mbox{ Size of a needle point? : }
10^{-3}m\]
\[ \mbox{ Size of hydrogen atom : } \[ 0.5 * 10^{-10}m \]
\[ \mbox{ Size of carbon atom: }  1.54 * 10^{-10}m\]

This gives us
\[ 2 * 10^7 \mbox{ Hydrogen atoms or } \]

\[ 6.66 * 10^6 \mbox{ Carbon atoms } \]


How do we measure something?

Units

Recall Maitreyi's stick

\subsubsection{Fundamental Units:}
\label{sec:org7b214b2}

Length : \[m\]
Mass   : \[kg\]
Time   : \[sec\]

\subsubsection{Derived units}
\label{sec:org98f18c1}
Volume : \[m^3\]

Density : \[\frac{kg}{m^3}\]

\subsection{Lecture 3 - 4 : July week 1 (1st  and 2nd)}
\label{sec:orgc491782}

\subsubsection{Brief: Accuracy of measurements and measuring time}
\label{sec:org005a198}
We discussed multiple ways of increasing accuracy of measurements.
We discussed how to measure time. Direct measurements involve clocks.
Principles of clocks (pendulum).
Solved problems regarding pendulum and discussed properties of pendulum.

\subsubsection{Instruments}
\label{sec:org68d324d}
\begin{enumerate}
\item Accuracy of instruments
\item Increasing accuracy
\item Measurement of time
\end{enumerate}

\subsubsection{Direct measurements:}
\label{sec:org8a3ac3c}
Measuring interval of pendulum

\subsubsection{Indirect measurement:}
\label{sec:org0f33d4a}
Measuring thickness of a paper.
Measuring diameter of a sub mm tube.

\subsubsection{Homework:}
\label{sec:org1b37abb}
\begin{enumerate}
\item Read chapter 1 and take notes in rough book of main points. and solve in chapter problems for chapter 1.
\item Solve in chapter problems in rough book (Not end of chatper problems).
\end{enumerate}


\subsection{Lecture 5 -6 :}
\label{sec:org84fc9e2}

\subsubsection{We did practicals of the concepts learned so far.}
\label{sec:org0c18b44}
Conducted experiments on pendulum and verified the observations/conclusions by swinging ourselves on the rope.
We also used a small boy and dunked him in water to measure density of a human body.
Recalled the Archimedes experiment

\subsubsection{Practicals}
\label{sec:org98f9c5a}
Observing pendulums
Swinging on rope
Measuring densities
Measure Density of a human

\subsubsection{Transcript}
\label{sec:org79f72a2}

Experiments:

\begin{enumerate}
\item Pendulum
\label{sec:org34b2bc1}

Apparatus: Pendulum with variable length and weight. Long rope (for children to swing on)

Hypothesis 1:
Pendulum period will increase with increase in wieght

Hypothesis 2:
Pendulum period will increase with its length

Hypothesis 3: Period will decrease if we release it from higher height

\begin{verbatim}

                      p  o        ---
                         |         |
                         |         |
                         |         |
                         |         |
                         |
                         |         L
                         |
                         |         |
                         |         |
                        ---        |
                    M  ( c )      ---
                        ---


\end{verbatim}

Lets call time taken by pendulum to perform one complete swing : T

Mass of pendulum is : M

Height at which the pendulum is released from : h

H1 -> \[ T \propto M \]

H2 -> \[ T \propto L \]

H3 -> \[ T \propto h \]

Experiment

Testing H1: Keeping length of pendulum same, change the weight (mass) M attached at the end.

Testing H2: Keeping mass of pendulum same, change the length L.

Testing H3: Keeping both length and mass of pendulum same, change the height at which we release the pendulum.

Important Note : The length of pendulum is from the pivot (P) to center of gravity of the weight (c). So if stacking up weights on top of each other to increase the mass remember to readjust the length so that it stays constant.

We verified our observations by swinging on a rope ourselves.


Observations:

For given length L = l (?? we didn't measure l). The period of pendulum was 1.6 seconds
No matter how much we changed M or h the period T did not change/

When we decreased L where l` < l : T also decreased

Conclusion

H1 and H3 are wrong.

Where as H2 is correct in the form that if we increase the length of pendulum the period increases and vise versa.

Extra work: How much does T increase or decrease if L is increased or decreased by 1 cm? (Precise answer is not expected but general thought about how it will behave)
Hint: Use the table in the 1st chapter questions which describes a student doing experiment with the pendulum.

\item Density
\label{sec:orgdc942ff}

Apparatus:

Large barrel and small person .
Enough water to fill the barrel.
A smaller measured water container to fill up specific quantities of water. (10 liter water container with markings at 1/2 , 1/4th )

\begin{verbatim}

       \      |^^^|         /
       |=======o=o=========|
       |      \---/        |
       |    |   |    |     |
       |    \---|---/      |
       |        |          |
       |        |          |
       |       / \         |
       |      /   \        |
       |-------------------|


\end{verbatim}
Procedure:

Fill the barrel, let the person sit in the barrel.
Fill the barrel with water fully.
Let the water stabilize.
Let out the person.

Observe the water level and slowly fill it up measuring using the marked container.


Observations:

We used 33.5 liters of water to fill the barrel completely again.

Arsh (the person used) has weight of 32.55 kg.

Calculations

\[ \rho = \frac{m}{v}  \]

\[ m = 32.55 liters \]

\[ 33.5l = 0.0335 m^3 \]

\[ \hence \rho = \frac{32.55}{0.0335} \frac{kg}{m^3} \]

\[ = 971.64 \frac{kg}{m^3}\]


\item Home work:
\label{sec:org9e7351e}
Arsh has weight of 32.55 kgs and volume we measured was 33.5 liters. Calculate his density.

Find out standard density of a human body from you biology teacher or any other sources.

Now that you know the density of a human body. What do you think happens when we jump in the water?

\begin{enumerate}
\item We sink immediately
\item We float
\end{enumerate}


Can we control if we sink or float? What are the various ways used to make body sink in water ? or float on water? Explain the mechanism by which it works.
\end{enumerate}
\end{document}
